{
 
    "GoalPage": {
      "whoWeAre": "من نحن؟",
      "intro": "منصة 'مستشارك الزراعي' هي وجهتك الأولى لكل ما يتعلق بالزراعة في الوطن العربي. تنقسم خدماتنا إلى:",
      "serviceOne": "قسم الاستشارات الزراعية: يضم فريقاً من الخبراء المتخصصين الذين يقدمون استشارات عملية حول إدارة المحاصيل، رعاية المواشي، تقنيات الري، والزراعة المستدامة لمساعدتك في اتخاذ قرارات مدروسة.",
      "serviceTwo": "قسم المحتوى الزراعي: نوفر لك أحدث المقالات، الفيديوهات، الدورات التدريبية، ومراجعات المنتجات الزراعية لتبقي مطلعاً على آخر الابتكارات في عالم الزراعة.",
      "ourGoalTitle": "هدفنا",
      "ourGoalDescription": "أن نصبح المنصة الرائدة والمرجع الأول لكل من يسعى لتحسين ممارساته الزراعية وتحقيق النجاح المستدام من خلال المعرفة المتخصصة والدعم المستمر.",
      "imageAlt": "هدفنا"
    },
    
        "Footer": {
          "bookDoctor": "  خدماتنا",
          "specialist1": "  احجز استشارة",
          "specialist2": " تركيب وتوريد شبكات الري",
          "specialist3": "تنسيق وصيانة الحدائق",
          "moreSpecialists": "المزيد من الخدمات",
          "followUs": "تابعنا",
          "ourServices": "المحتوي الزراعي",
          "medicalArticles": "مقالات زراعية",
          "medicalVideos": "فيديوهات زراعية",
          "podcast": "مقالات حيوانية ",
          "medicalQuestions": "اسئلة طبية",
          "askUs": "اسألينا؟",
          "aboutUs": "اعرف عننا",
          "whoWeAre": "من نحن",
          "termsOfUse": "سياسة الاستخدام",
          "contactUs": "تواصل معنا عبر :",
          "email": "البريد الإلكتروني",
          "whatsapp": "الواتساب",
          "rights": "جميع الحقوق محفوظة."
        },
        "Newsletter": {
    "heading": "إرشادات | فيديوهات | مقالات زراعية",
    "description": "انضم إلى أكثر من 5000 عضو! اشترك الآن للحصول على أحدث المقالات، الإجابات على أسئلتك، والتحديثات حول المجال الزراعي والحيواني. ابقَ مطلعًا ومتواصلًا معنا!"
  },
  "RecentPosts": {
    "noPosts": "لا توجد مقالات حديثة.",
    "header": "المقالات",
    "latestPosts": "أحدث المقالات",
    "more": "المزيد"
  },
    "SearchDoctorBar": {
        "searchFavoriteDoctor": " استشارتك الزراعية  مع ",
        "yourDoctor": " افضل المتخصصين", 
        "doctorDescription": "افضل المتخصصين الزراعيين ، متاحون لتقديم الاستشارات عبر الفيديو أو المكالمات الهاتفية. احصل على اسشارتك الزراعية بكل سهولة . ",
        "searchPlaceholder": "بحث",
        "searchButton": "بحث", 
        "allSpecialties": "جميع التخصصات"
      },
      "DoctorList": {
        "noDoctorsFound": "لم يتم العثور على متخصصين يطابقون معاييرك.",
        "generalSpecialty": "تخصص عام",
        "consultationPrice": "الاستشارة",
        "currency": "ج",
        "bookNow": " احجز الان"
      },
      "LoginForm": {
        "emailLabel": "البريد الالكتروني",
        "passwordLabel": "كلمة السر",
        "forgotPassword": "نسيت كلمة السر؟",
        "login": "تسجيل الدخول",
        "noAccount": "ليس لديك حساب؟",
        "registerNow": "سجل الأن",
        "invalidLogin": "بريد إلكتروني أو كلمة مرور غير صالحة. حاول مرة اخرى."
      },
    "RegisterForm": {
    "emailInvalid": "يجب أن يكون بريد إلكتروني صالح",
    "passwordMin": "كلمة السر يجب أن تحتوي على 6 أحرف على الأقل",
    "nameMin": "يجب أن يحتوي على الاسم الأول واسم العائلة",
    "nameRequired": "يجب أن يحتوي على الاسم الأول ومسافة واسم العائلة 'ex: mai ahmed'",
    "phoneInvalid": "رقم الهاتف يجب أن يكون صالح",
    "emailConflict": "البريد الإلكتروني مستخدم بالفعل. يرجى تسجيل الدخول.",
    "registrationError": "حدث خطأ أثناء التسجيل. يرجى المحاولة مرة أخرى.",
    "nameLabel": "الاسم",
    "emailLabel": "البريد الالكتروني",
    "passwordLabel": "كلمة السر",
    "phoneLabel": "رقم الهاتف",
    "submitting": "جاري انشاء الحساب...",
    "register": "تسجيل",
    "alreadyHaveAccount": "لديك حساب؟",
    "loginNow": "سجل الدخول",
    "termsOfUse": "سياسات الاستخدام"
  },
  "LoginLayout": {
    "communityText": "اكبر مجتمع خاص بالزراعة  في الوطن العربي"
  },    "PrivacyPolicy": {
    "title": "سياسة الخصوصية",
    "intro": "شكرًا لاستخدامك \"قلقانة\". ويهمنا للغاية ثقتكم بنا، ونحن ملتزمون بحماية خصوصية وأمن معلوماتك الشخصية. وتساعدنا المعلومات التي تشاركها معنا في أن نقدم لك تجربة رائعة مع \"قلقانة\". وتشير سياسة الخصوصية إلى ممارسات الخصوصية التي نتبعها بشأن جميع الخدمات التي نقدمها في جميع أنحاء العالم. يشير مصطلح \"قلقانة\" أو \"لنا\" أو \"نحن\" إلى شركة \"قلقانة\" المحدودة، بينما يشير مصطلح \"المستخدم\" و\"أنت\" و\"لك\" إلى شخصك بصفك مستخدم لخدمات \"قلقانة\". وتتضمن سياسة الخصوصية، إلى جانب شروط الاستخدام، القواعد والسياسات العامة التي تحكم استخدامك لمنصتنا. وربما يُطلب منك الموافقة على شروط وأحكام إضافية بناءً على نشاطك عند زيارة منصتنا:",
    "section1": "1. المعلومات التي نجمعها\n\n 1.1 تلتزم شركة \"قلقانة\" بالحفاظ على حماية خصوصية مستخدميها. وُوضعت سياسة الخصوصية التي نتبعها من أجل مساعدتك في فهم كيف نقوم بجمع المعلومات التي تزودنا بها واستخدامها وحمايتها. ولدى ولوجك إلى موقع \"قلقانة\"، نجمع تلقائيًا معلومات معينة حول جهازك، ومنها معلومات حول متصفح الويب الذي تستخدمه، وعنوان بروتوكول الإنترنت، ومنطقتك الزمنية، وبعض ملفات تعريف الارتباط (الكوكيز) المثبتة على جهازك. علاوة على ذلك، بينما تتصفح الموقع، نجمع معلومات حول صفحات الويب الفردية أو الأطباء الذين تشاهدهم، والمواقع الإلكترونية أو مصطلحات البحث التي أحالتك إلى موقع \"قلقانة\"، والمعلومات حول كيفية تفاعلك مع \"قلقانة\".\n\n 1.2 كما نقوم بجمع معلومات منك عند التسجيل على موقع \"قلقانة\" أو حجز موعد مع أحد الأطباء أو الاشتراك في نشرتنا الإخبارية. وعند الحجز أو التسجيل على موقعنا الإلكتروني، حسبما يكون مناسبًا، قد يُطلب منك إدخال اسمك وعنوان بريدك الإلكتروني وعنوانك البريدي ورقم هاتفك وتاريخ ميلادك (\"معلومات شخصية\").\n\n 1.3 قد نطلب منك أيضًا تزويدنا بمعلومات حول تحصيل المدفوعات من بطاقة ائتمانك أو بطاقة الخصم المباشر. وبعد إجراء معاملة ما، لن تُخزن هذه المعلومات الخاصة (بطاقات الائتمان، وأرقام الضمان الاجتماعي، والبيانات المالية، وما إلى ذلك) على خوادمنا.\n\n 1.4 يمكنك أن تطلب منا حذف هذه المعلومات في أي وقت، أو إلغاء الاشتراك من رسائل البريد الإلكتروني من خلال الولوج إلى إعدادات حسابك أو اتباع الإرشادات التفصيلية الواردة أسفل كل رسالة إلكترونية.",
    "section2": "2. كيف نستخدم بياناتك\n\n 2.1 نستخدم بعض المعلومات التي نجمعها لمساعدتنا في الكشف عن المخاطر المحتملة والاحتيال (لا سيما عنوان بروتوكول الإنترنت الخاص بك)، وبوجه أعم لتحسين موقع \"قلقانة\" والنهوض به إلى أفضل مستوى (على سبيل المثال، من خلال إنشاء تحليلات حول كيفية تصفح الموقع أو التطبيق عملائنا وتفاعلهم معهما، وكذلك لتقييم نجاح حملاتنا التسويقية والإعلانية).\n\n 2.2 نستخدم المعلومات الشخصية التي نجمعها بشكل عام لتلبية أي حجوزات تُجرى من خلال \"قلقانة\"، والتواصل معك، والكشف عن المخاطر المحتملة أو الاحتيال، وتزويدك بالمعلومات أو الإعلانات المتعلقة بمنتجاتنا أو خدماتنا عندما تتماشى المعلومات مع التفضيلات التي شاركتها معنا.",
    "section3": "3. حماية معلوماتك\n\n 3.1 نحن نسعى جاهدين لحماية معلوماتك عن طريق تطبيق معايير الحماية الدولية واتخاذ مجموعة متنوعة من التدابير الأمنية للحفاظ على سلامة معلوماتك الشخصية عندما تقوم بإجراء حجز أو تدخل معلوماتك الشخصية أو ترسلها أو الوصول إليها.\n\n 3.2 نقوم بفحص موقعنا الإلكتروني وتطبيقنا بانتظام بحثًا عن الثغرات الأمنية ونقاط الضعف وذلك للتأكد من أن زيارتك لموقعنا آمنة قدر المستطاع. ونحمي موقعنا الإلكتروني من خلال جدار حماية تطبيقات الويب الذي يقوم بتصفية ومراقبة حركة المرور بين تطبيق الويب وشبكة الإنترنت. ويكتشف هذا الجدار نقاط الضعف الشائعة في طبقات التطبيق على حافة الشبكة ويحجبها.\n\n 3.3 نحن نوفر خاصية استخدام خادم آمن. وتُرسل جميع المعلومات الحساسة / الائتمانية المقدمة عبر تقنية \"بروتوكول طبقة المقبس الآمن\" ثم تسجل في قاعدة بيانات \"مزودي بوابة الدفع\" الخاصة بنا وذلك لكي تكون تلك المعلومات متاحة فقط للأفراد الممنوحين حقوق الولوج الخاصة إلى هذه الأنظمة والذين يُطلب منهم الحفاظ على سرية المعلومات.\n\n 3.4 تُخزن بياناتنا مع مزود خارجي يحمل شهادات وتدقيقات معترف بها في مجال الصناعة، بما في ذلك معيار أمان بيانات صناعة بطاقات الدفع المستوى الأول، ومعيار الآيزو 27001، ومعيار \"تأثير معتدل\" لقانون إدارة أمن المعلومات الفيدرالي، والبرنامج الفيدرالي لإدارة المخاطر والتفويض، وقانون نقل التأمين الصحي والمساءلة.\n\n 3.5 كما نضمن أن جميع بياناتنا محمية بكلمة مرور، ويمكن الوصول إلى تلك البيانات من خلال المصادقة متعددة العوامل.",
    "section4": "4. إلى متى نحتفظ ببياناتك\n\n 4.1 المعايير المستخدمة لتحديد فترة تخزين البيانات الشخصية هي فترة الاحتفاظ القانونية المعنية. وبعد انقضاء تلك الفترة، تُحذف البيانات المقابلة بشكل روتيني، لطالما أنها لم تعد ضرورية للاضطلاع بخدماتنا.\n\n 4.2 نقوم بمعالجة وتخزين بياناتك الشخصية للفترة اللازمة لتحقيق الغرض من التخزين فقط. ووفقًا لذلك، إذا كان لدينا عنوان بريدك الإلكتروني لأننا نقدم خدمات معينة لك، فإننا نحتفظ بعنوان البريد الإلكتروني طوال الفترة التي نقدم لك فيها هذه الخدمات.\n\n 4.3 بصورة أساسية، نحتفظ ببياناتك إلى أن يتم حذف حسابك. ويمكنك الاطلاع على البيانات التي نجمعها منك في أي وقت، ويجوز لك أن تطلب حذفها في أي وقت من خلال الولوج إلى إعدادات حسابك.",
    "section5": "5. سياسة استخدام ملفات تعريف الارتباط\n\n 5.1 ملفات تعريف الارتباط هي ملفات صغيرة ينقلها الموقع أو مزود الخدمة إلى القرص الصلب لجهاز الحاسب الآلي من خلال متصفح الويب الخاص بك (إذا سمحتَ بذلك) والتي تمكن الموقع الإلكتروني أو أنظمة مزودي الخدمة من التعرف على متصفحك والتقاط معلومات معينة وتذكرها.\n\n 5.2 نحن نستخدم ملفات تعريف الارتباط لتحسين تجربتك للتحليلات ولإظهار عروض مصصمة خصيصًا لزياراتك السابقة إلى موقعنا الإلكتروني. كما نستخدم ملفات تعريف الارتباط لمساعدتنا في تجميع البيانات المجمعة حول ارتياد الموقع والتفاعل معه حتى نتمكن من تقديم تجربة مميزة وأدوات أفضل في المستقبل.\n\n 5.3 إذا كنت تفضل ذلك، يمكنك اختيار تفعيل خاصية التحذير في جهاز الحاسوب الخاص بك في كل مرة يتم فيها إرسال ملف تعريف ارتباط، أو يمكنك اختيار إيقاف تشغيل جميع ملفات تعريف الارتباط من خلال الولوج إلى إعدادات المتصفح الخاص بك.",
    "section6": "6. عدم الإفصاح عن المعلومات لطرف ثالث\n\n 6.1 نحن لا نبيع معلوماتك الشخصية المحددة إلى أطراف خارجية ولا نتاجر بها ولا ننقلها بأي طريقة أخرى. ولا يشمل ذلك الأطراف الثالثة الموثوقة التي تساعدنا في تشغيل موقعنا الإلكتروني أو إجراء أعمالنا أو تزويدك بالخدمات، طالما أن هذه الأطراف وافقت على الحفاظ على سرية هذه المعلومات.\n\n 6.2 لن تُخزن كافة تفاصيل الدفع والمعلومات الشخصية محددة الهوية أو تُباع لأي أطراف ثالثة أو تطلع عليها أو تسجيلها لديها.",
    "section7": "7. الإفصاح بشأن منصة \"إعلان جوجل ديسبلاي\"\n\n 7.1 نطبق ميزات تحليلات جوجل، أو \"جوجل أناليتيكس\"، التي تستخدم معلومات \"إعلان ديسبلاي\" من أجل إعداد تقارير الخصائص الديمغرافية والاهتمامات عبر أداة \"جوجل أناليتيكس\".\n\n 7.2 يمكنك إلغاء الاشتراك في أداة \"جوجل أناليتيكس\" لمنصة \"إعلان جوجل ديسبلاي\" وذلك لمنع استخدام بياناتك بواسطة أداة \"جوجل أناليتيكس\".\n\n 7.3 نستخدم ملفات تعريف ارتباط الطرف الأول جنبًا إلى جنب مع بائعي الطرف الثالث.",
    "section8": "8. روابط الطرف الثالث\n\n 8.1 يجوز لنا إدراج أو تقديم منتجات أو خدمات يقدمها طرف ثالث على موقعنا الإلكتروني. وتتبنى مواقع الأطراف الثالثة سياسات خصوصية منفصلة ومستقلة. وبالتالي، لا نتحمل أي مسؤولية أو التزام تجاه محتوى هذه المواقع المتصلة وأنشطتها.",
    "section9": "9. حقوقك\n\n 9.1 لديك الحق في الحصول على تأكيد بشأن ما إذا كانت بياناتك الشخصية قيد المعالجة أم لا.\n\n 9.2 يحق لك طلب المعلومات التي نقوم بمعالجتها حاليًا. كما يمكنك أن تطلب ما يلي لأغراض المعالجة؛ فئات البيانات الشخصية المعنية؛ والجهات المستفيدة أو فئات الجهات المستفيدة التي كُشفت البيانات الشخصية لها أو سيتم الكشف عنها، ولا سيما الجهات المستفيدة المتواجدة في دول ثالثة أو منظمات دولية.\n\n 9.3 لديك الحق في إبلاغنا بتغير معلوماتك، وعندما لم تعد المعلومات الموجودة لدينا في الملف دقيقة. وبالنظر إلى أغراض المعالجة، تتمتع بالحق في استكمال البيانات الشخصية غير الكاملة.\n\n 9.4 لك كل الحق في طلب محو البيانات الشخصية دون تأخير لا مبرر له.\n\n 9.5 يحق لك تلقي البيانات الشخصية المتعلقة بك التي قُدمت إلى وحدة التحكم، في صيغة منظمة وشائعة الاستخدام ومقروءة آليًا.\n\n 9.6 لديك الحق في الاعتراض، في أي وقت، على معالجة بياناتك الشخصية.\n\n 9.7 يحق لك سحب موافقتك على معالجة بياناتك الشخصية في أي وقت.",
    "section10": "10. شروط الاستخدام\n\n 10.1 يُرجى الاطلاع على شروط الاستخدام التي تحدد الاستخدام والتنازلات وحدود المسؤولية التي تحكم استخدام موقعنا الإلكتروني.",
    "section11": "11. موافقتك\n\n 11.1 أنت توافق على سياسة خصوصيتنا لدى زيارة موقعنا الإلكتروني.\n\n 11.2 يجوز تغيير شروط الاستخدام وسياسة الخصوصية الواردة في الموقع الإلكتروني أو تحديثها من حين لآخر لتلبية المتطلبات والمعايير القانونية.",
    "section12": "12. الاتصال بنا\n\n إذا كان لديك أية استفسارات بخصوص سياسة الخصوصية، يمكنك التواصل معنا عبر البريد الإلكتروني."
  },  "BookAppointment": {
    "book": "احجزي معاد",
    "selectDay": "اختاري اليوم",
    "selectTime": "اختاري الوقت بتوقيت مصر",
    "fullyBooked": "كل المواعيد محجوزة ، تحبي تشوفي دكتور تاني؟",
    "findAnotherDoctor": "اكتشفي الدكاترة",
    "loginRequired": "يجب تسجيل الدخول للمتابعة",
    "login": "تسجيل الدخول",
    "oneStepLeft": "خطوة واحدة ونكمل الحجز",
    "selectedDay": "اليوم المختار",
    "selectedDate": "التاريخ المختار",
    "selectedTime": "الوقت المختار بتوقيت مصر",
    "goToPayment": "30 دقيقة \"اذهبي الي منصة الدفع\"",
    "free30Min": "30 دقيقة مجانية",
    "free10Min": "10 دقائق مجانية",
    "success": "مبروك ، تم الحجز بنجاح !",
    "paymentPending": "بعد اتمام الدفع ستجدي الحجز والتفاصيل في حجوزاتي",
    "myBookings": "حجوزاتي"
  },
  "daysOfWeek": {
    "sunday": "الأحد",
    "monday": "الاثنين",
    "tuesday": "الثلاثاء",
    "wednesday": "الأربعاء",
    "thursday": "الخميس",
    "friday": "الجمعة",
    "saturday": "السبت"
  },
  "or": "أو",
  "next": "التالي",
  "back": "رجوع",
  "close": "اغلاق",
  "MyBookings": {
    "myBookings": "حجوزاتي",
    "operationSuccess": "تمت العملية بنجاح",
    "operationFailed": "لم تنجح العملية يرجي اعادة المحاولة",
    "userNotAuthenticated": "المستخدم غير مسجل الدخول",
    "fetchFailed": "فشل في استرجاع البيانات",
    "fetchDoctorFailed": "فشل في استرجاع بيانات الطبيب {{doctorId}}",
    "ratingFailed": "فشل في تقديم التقييم",
    "doctorDuties": "واجبات الدكتور تجاه المريض.pdf",
    "medicalConsent": "الموافقات الطبية.pdf",
    "doctorConsentNote": "بمجرد دخولك اللقاء يعني موافقتك علي الشروط الطبية",
    "patientConsentNote": "بمجرد دخولك اللقاء يعني موافقتك علي الشروط الطبية",
    "upcoming": "القادم",
    "pastBookings": "الحجوزات السابقة",
    "noUpcomingBookings": "لا يوجد حجوزات حالية",
    "bookNow": "احجز الان",
    "helpMessage": "ترغبين في مساعدة؟ تواصلي معنا عبر"
  },  "RecentPodcast": {
    "titleHome": "بودكاست قلقانة",
    "titleWatchAlso": "شاهد أيضاً",
    "noPodcasts": "لا توجد بودكاست متاحة.",
    "errorLoading": "حدث خطأ أثناء تحميل البودكاست."
  }, "RecentPost": {
    "noVideos": "لا توجد فيديوهات متاحة.",
    "videos": "الفيديوهات",
    "latestVideos": "أحدث الفيديوهات",
    "more": "المزيد"
  },"FeaturedPosts": {
    "mostPopular": "الأكثر رواجا",
    "errorFetching": "حدث خطأ أثناء جلب الفيديوهات."
  }, "CoverSection": {
    "videos": "الفيديوهات",
    "consultationLink": "محتارة في استشارة؟ احجزي مكالمة صوتية أو فيديو الآن مع أفضل الدكاترة في مصر من بيتك."
,
    "errorLoadingVideo": "خطأ في تحميل الفيديو",
    "podcast": "بودكاست",
    "errorLoadingPodcast": "خطأ في تحميل البودكاست",
    "articles": "المقالات",
    "errorLoadingBlog": "خطأ في تحميل المقال",
    "noImageAvailable": "لا توجد صورة متاحة",
    "uncategorized": "غير مصنفة"
  }, "FeaturePosts": {
    "mostPopular": "الأكثر رواجا",
    "errorFetchingBlogs": "حدث خطأ أثناء جلب المقالات."
  }, "DoctoorBoster": {
    "onlineConsultation": "استشارتك اونلاين مع اشطر المتخصصين  في مصر",
    "seeDoctors": "احجز الان ",
    "doctorImageAlt": "طبيب"
  }, "HeroQestion": {
    "title": "ابعتي استشاراتك الطبية",
    "subtitle": "واحنا نجاوبك",
    "description": "لأن صحتك اهم حاجة عندنا ، وفرنالك فريق عمل متخصص للرد علي جميع استفساراتك الطبية",
    "askButton": "ابعتي سؤالك",
    "bookButton": "احجزي مع دكتور"
  }, "AskDoctor": {
    "successMessage": "تم ارسال سؤالك بنجاح، نعدك بالرد قريبا وشكرا لاستخدامك قلقانة!",
    "askAnotherQuestion": "اسألي سؤال تاني؟",
    "bookOnlineNow": "احجزي مع دكتور اونلاين الآن",
    "askYourQuestion": "اطرح سؤالك الآن ليصل إلى آلاف الأطباء",
    "description": "احصلي على إجابة لسؤالك في غضون 48 ساعة، أو اشتركي مع قلقانة لتحصلي على استشارة فورية وسرية مع طبيب معتمد.",
    "talkToDoctorNow": "تحدثي مع طبيب الآن",
    "questionTitlePlaceholder": "عنوان السؤال (عنوان مختصر لمشكلتك الصحية)",
    "questionContentPlaceholder": "محتوى السؤال (اشرح كافة استفساراتك)",
    "selectTag": "اختر تصنيفًا للسؤال",
    "selectTagPlaceholder": "اختر تصنيفًا",
    "errorTitle": "عنوان السؤال مطلوب",
    "errorContent": "محتوى السؤال مطلوب",
    "errorTag": "اختر تصنيفًا للسؤال",
    "warning": "بعد ارفاق السؤال سيتم عرضه للجمهور، لذا يرجي توخي الحذر وازالة اي معلومات خاصة",
    "submit": "ارسال",
    "emergencyMessage": "إذا كانت الحالة الطبية طارئة ننصحك بالتوجه إلى أقرب مركز طوارئ في منطقتك"
  }, "Details": {
    "generalSpeciality": "تخصص عام",
    "consultationPrice": "الكشف",
    "currency": "ج",
    "doctorInfo": "معلومات عن الدكتور",
    "noAdditionalInfo": "لا توجد معلومات إضافية."
  }, "FileManagement": {
    "keepAll": "احتفظ بكل",
    "yourMedicalData": "بياناتك الصحية",
    "inOnePlace": "في مكان واحد بكل سهولة وأمان.",
    "tooltipInfo": "بياناتك الطبية مؤمنة بالكامل. لا يمكن لأحد رؤيتها إلا عند الاشتراك مع أحد الأطباء، وهو الوحيد الذي يستطيع الاطلاع عليها.",
    "fetchError": "خطأ في جلب الملفات الطبية.",
    "deleteSuccess": "تم حذف الملف بنجاح.",
    "deleteError": "خطأ في حذف الملف.",
    "loading": "جارٍ التحميل..."
  },
  "MyProfile": {
    "unauthorizedUser": "المستخدم غير مصرح له",
    "fetchUserFailed": "فشل في جلب بيانات المستخدم",
    "fetchUserError": "حدث خطأ أثناء جلب بيانات المستخدم"
  },"UpdatePhoneNumberForm": {
    "updatePhoneNumber": "تحديث رقم الهاتف",
    "editPhoneNumber": "تعديل رقم الهاتف",
    "unauthorizedUser": "المستخدم غير مصرح له",
    "fetchUserFailed": "فشل في جلب بيانات المستخدم",
    "fetchUserError": "حدث خطأ أثناء جلب بيانات المستخدم",
    "phoneNumberMinLength": "رقم الهاتف يجب أن يكون على الأقل 5 أرقام.",
    "phoneNumberUpdateSuccess": "تم تحديث رقم الهاتف بنجاح",
    "phoneNumberUpdateFailed": "فشل في تحديث رقم الهاتف",
    "phoneNumberUpdateError": "حدث خطأ أثناء تحديث رقم الهاتف"
  },  "FileUpload": {
    "uploadButton": "رفع ملفات (صور أو ملفات PDF)",
    "uploadingFiles": "جاري تحميل الملفات ...",
    "uploadError": "خطأ في تحميل الملف.",
    "uploadSuccess": "تم تحميل الملف الطبي بنجاح.",
    "uploadFileFailed": "فشل في تحميل الملف.",
    "uploadMedicalInfoFailed": "فشل في تحميل بيانات الملف الطبي.",
    "medicalFileInfoError": "خطأ في تحميل بيانات الملف الطبي."
  }, "FilePreview": {
    "pdfFile": "ملف PDF",
    "download": "تحميل",
    "fullSize": "الحجم الكامل"
  }
}
    
  